#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Introducere în PHP
#+date: <2025-04-02 Mi>
#+author: Petru Rebeja
#+email: petru.rebeja@gmail.com
#+language: ro
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.4 (Org mode 9.6.15)
#+cite_export:

* Pregătirea mediului de lucru

** Crearea directorului pentru codul-sursă

#+begin_src shell
  mkdir -p /tmp/tehnologii-web/
#+end_src

* Rulare script

** Descărcăm imaginea =php:8=

#+begin_src shell :results none
  podman pull php:8.2-cli
#+end_src

** Creăm un script

#+begin_src shell
  echo "<?php echo \"Hello World!\" ?>" > /tmp/tehnologii-web/hw.php
#+end_src

*** Verificăm că scriptul a fost creat

#+begin_src shell
  ls -al /tmp/tehnologii-web/
#+end_src
** Rulăm scriptul într-un container

#+begin_src shell
  cd /tmp/tehnologii-web/ && \
  podman run \
         -it \
         --rm \
         --name my-running-script \
         -v "$PWD":/tmp/tehnologii-web \
         -w /tmp/tehnologii-web \
         php:8.2-cli php hw.php
#+end_src

* Rulare pagnă

** Descărcăm imaginea =php:8=

#+begin_src shell :results none
  podman pull php:8.2-apache
#+end_src

** Creăm o pagină

#+begin_src shell :results silent
  echo "<!DOCTYPE html>
  <html>
    <body>
      <?php echo \"Hello world!\" ?>
    </body>
  </html>
  " > /tmp/tehnologii-web/index.php
#+end_src

*** Verificăm dacă scriptul =PHP= a fost creat

#+begin_src shell
  ls -al /tmp/tehnologii-web/
#+end_src

** Creăm fișierul =Dockerfile=

#+begin_src shell :results silent
  echo "FROM php:8.2-apache
  COPY index.php /var/www/html/
  " > /tmp/tehnologii-web/Dockerfile
#+end_src

** Construim imaginea =Docker= și rulăm aplicația într-un container

#+begin_src shell :results silent
  cd /tmp/tehnologii-web/ && \
  podman build -t hello-world-php . && \
  podman run -d -p 8081:80 --name hw-app-container hello-world-php
#+end_src

Aplicația =PHP= poate fi accesată la adresa http://localhost:8081/.

** Oprim containerul și ștergem imaginea

#+begin_src shell
  podman stop hw-app-container && \
      podman rm hw-app-container && \
      podman rmi localhost/hello-world-php
#+end_src

#+RESULTS:
| hw-app-container |                                                                  |
| hw-app-container |                                                                  |
| Untagged:        | localhost/hello-world-php:latest                                 |
| Deleted:         | f9cfefe3c8ff0e4d396c6d8c6a7b272557dafe7c77820433b9b9a1ba9a1c65aa |
